package by.epam.unit03.main;

public class Task08 {

    public static void main(String[] args) {
        //Задача 8
        //Написать программу, в которой вводятся два операнда Х и Y и знак операции
        //(+, –, /, *). Вычислить результат Z в зависимости от знака. Предусмотреть
        //реакции на возможный неверный знак операции, а также на ввод Y=0 при
        //делении. Организовать возможность многократных вычислений без
        //перезагрузки программа (т.е. построить цикл). В качестве символа
        //прекращения вычислений принять ‘#’
    }
}
